import json
import numpy as np

# ---------------------------------------------------------------------------- #
#                                     記憶演算法                               #
# ---------------------------------------------------------------------------- #
# ---------------------------------- 設定網路參數 ---------------------------------- #
Ninp: int = 100  # 輸入層神經元數量
W = np.zeros((Ninp, Ninp), dtype=float)
# -------------------------------- 設定神經元的連結加權值 ------------------------------- #
data = {}
with open("trainData.json", "r") as f:
    data = json.load(f)  # 讀取訓練資料

for itrain in data.values():
    reshapeData = np.array(itrain).reshape(100)
    for i in range(Ninp):
        for j in range(Ninp):
            W[i][j] += reshapeData[i] * reshapeData[j]
    for i in range(Ninp):
        W[i][i] = 0
# ---------------------------------------------------------------------------- #
#                                     聯想演算法                               #
# ---------------------------------------------------------------------------- #
# ---------------------------------- 設定網路參數 ---------------------------------- #
Ntest = 2  # 聯想樣本數量

# ---------------------------------- 更新網路狀態值 --------------------------------- #
